app/views/chords/new.html.erb

      <div id="element_name">
        <%= ElementLibrary.find_by(id: @element_ids[index]).name %>
---
SELECT  "element_libraries".* FROM "element_libraries" WHERE "element_libraries"."id" = $1 LIMIT 1  [["id", 1]]