app/views/songs/index.html.erb

SELECT "keys".* FROM "keys"
---
          <ul class="dropdown-menu" role="menu">
          <% Key.all.each do |keysignature| %>

SELECT "time_signatures".* FROM "time_signatures"
---
          <ul class="dropdown-menu" role="menu">
          <% TimeSignature.all.each do |timesignature| %>