app/controllers/api/v1/chords_controller.rb

  def show
    @chords = Song.find_by(id: params[:id]).key.chords
---
SELECT  "keys".* FROM "keys" WHERE "keys"."id" = $1 LIMIT 1  [["id", 9]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "chords".* FROM "chords" INNER JOIN "chord_by_keys" ON "chords"."id" = "chord_by_keys"."chord_id" WHERE "chord_by_keys"."key_id" = $1  [["key_id", 9]]