app/controllers/api/v1/songs_controller.rb

  def index
    @songs = Song.where(user_id: current_user.id)
    @keys = Key.all
    @time_signatures = TimeSignature.all
    @tempos = Tempo.all
    @elements = ElementLibrary.all
---
SELECT "songs".* FROM "songs" WHERE "songs"."user_id" = $1  [["user_id", 1]]
SELECT "keys".* FROM "keys"
SELECT "time_signatures".* FROM "time_signatures"
SELECT "tempos".* FROM "tempos"
SELECT "element_libraries".* FROM "element_libraries"

  def create
    @song = Song.new(name: params[:title], key_id: params[:key], time_signature_id: params[:time_signature], tempo_id: params[:tempo], user_id: current_user.id)
    if @song.save
---
INSERT INTO "songs" ("name", "key_id", "time_signature_id", "tempo_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "the song"], ["key_id", 2], ["time_signature_id", "3"], ["tempo_id", 2], ["user_id", 1], ["created_at", "2017-09-27 17:24:45.832400"], ["updated_at", "2017-09-27 17:24:45.832400"]]