app/controllers/api/v1/structures_controller.rb

  def create
    # element_1 = params[:element_1][:element_library_id]
    # @length_1 = params[:length][:length_id_1].to_i
    # element_2 = params[:element_1][:element_library_id]
    # @length_2 = params[:length][:length_id_2].to_i
    # song_id = params[:song_id]
    _json = params[:_json]

    position = 1

    _json.each do |element|
      puts "chocolate"
      p element[:song_id]
      beat_unit = Song.find_by(id: element[:song_id]).time_signature.beat_unit
      puts "pretzel"
      p beat_unit
      element_number = (element[:elementLength]).to_i
      puts "cheese"
      p element_number
      element_length = beat_unit*element_number


      element_length.times do
        Structure.create(position: position, element_library_id: element[:elementId], song_id: element[:song_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "time_signatures".* FROM "time_signatures" WHERE "time_signatures"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "structures" ("position", "element_library_id", "song_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["position", 1], ["element_library_id", 1], ["song_id", 1], ["created_at", "2017-09-27 03:49:46.447141"], ["updated_at", "2017-09-27 03:49:46.447141"]]