app/controllers/chords_controller.rb

  def new
    @song = Song.find_by(id: params[:song])
    beat_unit = @song.time_signature.beat_unit
    structures = @song.structures.order(:position)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "structures".* FROM "structures" WHERE "structures"."song_id" = $1  ORDER BY "structures"."position" ASC  [["song_id", 1]]