app/controllers/songs_controller.rb

  def show
    @song = Song.find_by(id: params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 1]]