app/controllers/structures_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "structures".* FROM "structures" WHERE "structures"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "structures" SET "chord_id" = $1, "updated_at" = $2 WHERE "structures"."id" = $3  [["chord_id", 1], ["updated_at", "2017-09-27 03:50:02.218616"], ["id", 1]]
INSERT INTO "lyrics" ("line_number", "lyric", "song_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["line_number", 1], ["lyric", "fjdskafjdklsaf"], ["song_id", 1], ["created_at", "2017-09-27 03:50:02.448629"], ["updated_at", "2017-09-27 03:50:02.448629"]]
---
  def update

    @song = Song.find_by(id: params[:id])
    puts "aSFDDSAFSAFSAF"
    params[:structures].each do |structure_id, chord_hash|
      Structure.find_by(id: structure_id).update(chord_id: chord_hash["chord_id"])
    end
    # length = @song.structures.order(:position).count
    # position = 1
    # length.times do
    #   Structure.find_by(song_id: params[:id], position: position).update(chord_id: params[:structures][:chord_id])
    #   position += 1
    # end

    line_counter = 1
    params[:lyrics].each do |line_number, lyrics|
      Lyric.create(line_number: (line_number.to_i + 1), lyric: lyrics, song_id: @song.id)